ljunquera/arduino-smartwatch-boards/boards.txt
# Copyright (c) 2014-2015 Arduino LLC.  All right reserved.
# Copyright (c) 2016 Sandeep Mistry All right reserved.
#
# This library is free software; you can redistribute it and/or
# modify it under the terms of the GNU Lesser General Public
# License as published by the Free Software Foundation; either
# version 2.1 of the License, or (at your option) any later version.
#
# This library is distributed in the hope that it will be useful,
# but WITHOUT ANY WARRANTY; without even the implied warranty of
# MERCHANTABILITY or FITNESS FOR A PARTICULAR PURPOSE.
# See the GNU Lesser General Public License for more details.
#
# You should have received a copy of the GNU Lesser General Public
# License along with this library; if not, write to the Free Software
# Foundation, Inc., 51 Franklin St, Fifth Floor, Boston, MA  02110-1301  USA

menu.chip=Chip
menu.softdevice=Softdevice
menu.version=Version
menu.lfclk=Low Frequency Clock
menu.board_variant=Board Variant


###################


kalincoP22.name=Kalinco Smart Watch p22

kalincoP22.upload.tool=nRF52D6Fitness:openocd
kalincoP22.upload.target=nrf52
kalincoP22.upload.maximum_size=409600

kalincoP22.bootloader.tool=nRF52D6Fitness:openocd

kalincoP22.build.mcu=cortex-m4
kalincoP22.build.f_cpu=16000000
kalincoP22.build.board=DSD6
kalincoP22.build.core=nRF5
kalincoP22.build.variant=DSD6
kalincoP22.build.variant_system_lib=
kalincoP22.build.extra_flags=-DNRF52
kalincoP22.build.float_flags=-mfloat-abi=hard -mfpu=fpv4-sp-d16 -DCONFIG_NFCT_PINS_AS_GPIOS -DUSE_LFRC -DNRF52 -DS132 -DNRF51_S132
kalincoP22.build.ldscript=armgcc_s132_nrf52832_xxaa.ld

kalincoP22.menu.softdevice.stockFW=Only Softdevice for Flashing via SWD
kalincoP22.menu.softdevice.stockFW.flashVariantFile=sd.hex
kalincoP22.menu.softdevice.stockFW.softdeviceversion=2.0.1
kalincoP22.menu.softdevice.stockFW.softdevice=s132
kalincoP22.menu.softdevice.onlySoftDevice=Back To Stock Firmware
kalincoP22.menu.softdevice.onlySoftDevice.flashVariantFile=flash.bin
kalincoP22.menu.softdevice.onlySoftDevice.softdeviceversion=2.0.1
kalincoP22.menu.softdevice.onlySoftDevice.softdevice=s132

###########################
